xml/StartTransaction.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>{{.ChargeBoxID}}</ns:chargeBoxIdentity>
        <ns:MessageID>{{.MessageID}}</ns:MessageID>
        <wsa5:Action>/StartTransaction</wsa5:Action>
    </x:Header>
    <x:Body>
        <ns:startTransactionRequest>
            <ns:connectorId>1</ns:connectorId>
            <ns:idTag>{{.AuthID}}</ns:idTag>
            <ns:timestamp>{{.DateTimeStart}}</ns:timestamp>
            <ns:meterStart>0</ns:meterStart>
            <ns:reservationId>0</ns:reservationId>
        </ns:startTransactionRequest>
    </x:Body>
</x:Envelope>